Revit 2026 API

# ViewGetLinkOverrides Method

---

Gets the graphic overrides of a RevitLinkType or RevitLinkInstance in view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RevitLinkGraphicsSettings GetLinkOverrides(
	ElementId linkId
)
```
```vb
Public Function GetLinkOverrides (
	linkId As ElementId
) As RevitLinkGraphicsSettings
```
```cpp
public:
RevitLinkGraphicsSettings^ GetLinkOverrides(
	ElementId^ linkId
)
```
```fsharp
member GetLinkOverrides :
        linkId : ElementId -> RevitLinkGraphicsSettings
```

#### Parameters

linkId ElementId
     The id of the RevitLinkType or RevitLinkInstance.

#### Return Value

RevitLinkGraphicsSettings Settings representing graphic overrides for the input element id in the view, or  if the input id references RevitLinkInstance and it doesn't have overrides in the view.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input id is not a valid RevitLinkInstance or RevitLinkType id. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

View Class

Autodesk.Revit.DB Namespace